const KanaMap={
	'あ':'ア', 'い':'イ', 'う':'ウ', 'え':'エ', 'お':'オ',
	'ぁ':'ァ', 'ぃ':'ィ', 'ぅ':'ゥ', 'ぇ':'ェ', 'ぉ':'ォ',
	'か':'カ', 'き':'キ', 'く':'ク', 'け':'ケ', 'こ':'コ',
	'が':'ガ', 'ぎ':'ギ', 'ぐ':'グ', 'げ':'ゲ', 'ご':'ゴ',
	'さ':'サ', 'し':'シ', 'す':'ス', 'せ':'セ', 'そ':'ソ',
	'ざ':'ザ', 'じ':'ジ', 'ず':'ズ', 'ぜ':'ゼ', 'ぞ':'ゾ',
	'た':'タ', 'ち':'チ', 'つ':'ツ', 'て':'テ', 'と':'ト',
	'だ':'ダ', 'ぢ':'ヂ', 'づ':'ヅ', 'で':'デ', 'ど':'ド',
	'な':'ナ', 'に':'ニ', 'ぬ':'ヌ', 'ね':'ネ', 'の':'ノ',
	'は':'ハ', 'ひ':'ヒ', 'ふ':'フ', 'へ':'ヘ', 'ほ':'ホ',
	'ば':'バ', 'び':'ビ', 'ぶ':'ブ', 'べ':'ベ', 'ぼ':'ボ',
	'ぱ':'パ', 'ぴ':'ピ', 'ぷ':'プ', 'ぺ':'ペ', 'ぽ':'ポ',
	'ま':'マ', 'み':'ミ', 'む':'ム', 'め':'メ', 'も':'モ',
	'や':'ヤ', 'ゆ':'ユ', 'よ':'ヨ',
	'ゃ':'ャ', 'ゅ':'ュ', 'ょ':'ョ', 'っ':'ッ', 'ゎ':'ヮ',
	'ら':'ラ', 'り':'リ', 'る':'ル', 'れ':'レ', 'ろ':'ロ',
	'わ':'ワ', 'ゐ':'ヰ', 'ゑ':'ヱ', 'を':'ヲ', '－':'ー',
}
const KanaKeys=Object.keys(KanaMap)
const KanaRegx=new RegExp('['+KanaKeys.join('')+']','g');

export const toKatakana=(src: string):string=>{
	return src.replaceAll(KanaRegx,(c)=>{return KanaMap[c]});
}
